mhorsche/F746_NucleoTemplate/Inc/stm32f7xx_hal_conf.h
/**
 ******************************************************************************
 * @file    stm32f7xx_hal_conf_template.h
 * @author  MCD Application Team
 * @brief   HAL configuration template file.
 *          This file should be copied to the application folder and renamed
 *          to stm32f7xx_hal_conf.h.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2017 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F7xx_HAL_CONF_H
#define __STM32F7xx_HAL_CONF_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
 * @brief This is the list of modules to be used in the HAL driver
 */
#define HAL_MODULE_ENABLED
/* #define HAL_ADC_MODULE_ENABLED   */
/* #define HAL_CAN_MODULE_ENABLED */
/* #define HAL_CAN_LEGACY_MODULE_ENABLED */
/* #define HAL_CEC_MODULE_ENABLED   */
/* #define HAL_CRC_MODULE_ENABLED   */
/* #define HAL_CRYP_MODULE_ENABLED   */
/* #define HAL_DAC_MODULE_ENABLED   */
/* #define HAL_DCMI_MODULE_ENABLED  */
#define HAL_DMA_MODULE_ENABLED
/* #define HAL_DMA2D_MODULE_ENABLED  */
#define HAL_ETH_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
/* #define HAL_NAND_MODULE_ENABLED */
/* #define HAL_NOR_MODULE_ENABLED */
/* #define HAL_SRAM_MODULE_ENABLED */
/* #define HAL_SDRAM_MODULE_ENABLED */
/* #define HAL_HASH_MODULE_ENABLED   */
#define HAL_GPIO_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
/* #define HAL_I2S_MODULE_ENABLED    */
/* #define HAL_IWDG_MODULE_ENABLED  */
/* #define HAL_LPTIM_MODULE_ENABLED */
/* #define HAL_LTDC_MODULE_ENABLED  */
#define HAL_PWR_MODULE_ENABLED
/* #define HAL_QSPI_MODULE_ENABLED    */
#define HAL_RCC_MODULE_ENABLED
#define HAL_RNG_MODULE_ENABLED
/* #define HAL_RTC_MODULE_ENABLED */
/* #define HAL_SAI_MODULE_ENABLED    */
/* #define HAL_SD_MODULE_ENABLED   */
/* #define HAL_SPDIFRX_MODULE_ENABLED */
/* #define HAL_SPI_MODULE_ENABLED    */
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
/* #define HAL_USART_MODULE_ENABLED  */
/* #define HAL_IRDA_MODULE_ENABLED  */
/* #define HAL_SMARTCARD_MODULE_ENABLED  */
/* #define HAL_WWDG_MODULE_ENABLED   */
#define HAL_CORTEX_MODULE_ENABLED
/* #define HAL_PCD_MODULE_ENABLED */
/* #define HAL_HCD_MODULE_ENABLED */

/* ########################## Timeout Configuration ######################### */
/**
 * @brief This is the HAL configuration section
 */
// #define HAL_TIMEOUT_ENABLED          1
#define HAL_ACCURATE_TIMEOUT_ENABLED 0
#define HAL_TIMEOUT_VALUE 0x1FFFFFF

/* ########################## HSE/HSI Values adaptation ##################### */
/**
 * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSE is used as system clock source, directly or through the PLL).
 */
#if !defined(HSE_VALUE)
#define HSE_VALUE ((uint32_t)8000000U) /*!< Value of the External oscillator in Hz */
#endif                                 /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT ((uint32_t)5000U) /*!< Time out for HSE start up, in ms */
#endif                                        /* HSE_STARTUP_TIMEOUT */

/**
 * @brief Internal High Speed oscillator (HSI) value.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSI is used as system clock source, directly or through the PLL).
 */
#if !defined(HSI_VALUE)
#define HSI_VALUE ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif                                  /* HSI_VALUE */

/**
 * @brief Internal Low Speed oscillator (LSI) value.
 */
#if !defined(LSI_VALUE)
#define LSI_VALUE ((uint32_t)32000U) /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */               /*!< Value of the Internal Low Speed oscillator in Hz \
                                      The real value may vary depending on the variations  \
                                      in voltage and temperature.  */
/**
 * @brief External Low Speed oscillator (LSE) value.
 */
#if !defined(LSE_VALUE)
#define LSE_VALUE ((uint32_t)32768U) /*!< Value of the External Low Speed oscillator in Hz */
#endif                               /* LSE_VALUE */
#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT ((uint32_t)5000U) /*!< Time out for LSE start up, in ms */
#endif                                        /* LSE_STARTUP_TIMEOUT */

/**
 * @brief External clock source for I2S peripheral
 *        This value is used by the I2S HAL module to compute the I2S clock source
 *        frequency, this source is inserted directly through I2S_CKIN pad.
 */
#if !defined(EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE ((uint32_t)12288000U) /*!< Value of the Internal oscillator in Hz*/
#endif                                             /* EXTERNAL_CLOCK_VALUE */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
 * @brief This is the HAL system configuration section
 */
#define VDD_VALUE ((uint32_t)3300U)         /*!< Value of VDD in mv */
#define TICK_INT_PRIORITY ((uint32_t)0x0FU) /*!< tick interrupt priority */
#define USE_RTOS 0U
#define ART_ACCELERATOR_ENABLE 1U /* To enable instruction cache and prefetch */

#define USE_HAL_ADC_REGISTER_CALLBACKS 0U       /* ADC register callback disabled       */
#define USE_HAL_CAN_REGISTER_CALLBACKS 0U       /* CAN register callback disabled       */
#define USE_HAL_CEC_REGISTER_CALLBACKS 0U       /* CEC register callback disabled       */
#define USE_HAL_CRC_REGISTER_CALLBACKS 1U       /* CRC register callback disabled       */
#define USE_HAL_CRYP_REGISTER_CALLBACKS 0U      /* CRYP register callback disabled      */
#define USE_HAL_DAC_REGISTER_CALLBACKS 0U       /* DAC register callback disabled       */
#define USE_HAL_DCMI_REGISTER_CALLBACKS 0U      /* DCMI register callback disabled      */
#define USE_HAL_DFSDM_REGISTER_CALLBACKS 0U     /* DFSDM register callback disabled     */
#define USE_HAL_DMA2D_REGISTER_CALLBACKS 0U     /* DMA2D register callback disabled     */
#define USE_HAL_DSI_REGISTER_CALLBACKS 0U       /* DSI register callback disabled       */
#define USE_HAL_ETH_REGISTER_CALLBACKS 0U       /* ETH register callback disabled       */
#define USE_HAL_HASH_REGISTER_CALLBACKS 0U      /* HASH register callback disabled      */
#define USE_HAL_HCD_REGISTER_CALLBACKS 0U       /* HCD register callback disabled       */
#define USE_HAL_I2C_REGISTER_CALLBACKS 1U       /* I2C register callback disabled       */
#define USE_HAL_I2S_REGISTER_CALLBACKS 0U       /* I2S register callback disabled       */
#define USE_HAL_IRDA_REGISTER_CALLBACKS 0U      /* IRDA register callback disabled      */
#define USE_HAL_JPEG_REGISTER_CALLBACKS 0U      /* JPEG register callback disabled      */
#define USE_HAL_LPTIM_REGISTER_CALLBACKS 0U     /* LPTIM register callback disabled     */
#define USE_HAL_LTDC_REGISTER_CALLBACKS 0U      /* LTDC register callback disabled      */
#define USE_HAL_MDIOS_REGISTER_CALLBACKS 0U     /* MDIOS register callback disabled     */
#define USE_HAL_MMC_REGISTER_CALLBACKS 0U       /* MMC register callback disabled       */
#define USE_HAL_NAND_REGISTER_CALLBACKS 0U      /* NAND register callback disabled      */
#define USE_HAL_NOR_REGISTER_CALLBACKS 0U       /* NOR register callback disabled       */
#define USE_HAL_PCD_REGISTER_CALLBACKS 0U       /* PCD register callback disabled       */
#define USE_HAL_QSPI_REGISTER_CALLBACKS 0U      /* QSPI register callback disabled      */
#define USE_HAL_RNG_REGISTER_CALLBACKS 1U       /* RNG register callback disabled       */
#define USE_HAL_RTC_REGISTER_CALLBACKS 0U       /* RTC register callback disabled       */
#define USE_HAL_SAI_REGISTER_CALLBACKS 0U       /* SAI register callback disabled       */
#define USE_HAL_SD_REGISTER_CALLBACKS 0U        /* SD register callback disabled        */
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U /* SMARTCARD register callback disabled */
#define USE_HAL_SDRAM_REGISTER_CALLBACKS 0U     /* SDRAM register callback disabled     */
#define USE_HAL_SRAM_REGISTER_CALLBACKS 0U      /* SRAM register callback disabled      */
#define USE_HAL_SPDIFRX_REGISTER_CALLBACKS 0U   /* SPDIFRX register callback disabled   */
#define USE_HAL_SMBUS_REGISTER_CALLBACKS 0U     /* SMBUS register callback disabled     */
#define USE_HAL_SPI_REGISTER_CALLBACKS 1U       /* SPI register callback disabled       */
#define USE_HAL_TIM_REGISTER_CALLBACKS 1U       /* TIM register callback disabled       */
#define USE_HAL_UART_REGISTER_CALLBACKS 1U      /* UART register callback disabled      */
#define USE_HAL_USART_REGISTER_CALLBACKS 0U     /* USART register callback disabled     */
#define USE_HAL_WWDG_REGISTER_CALLBACKS 0U      /* WWDG register callback disabled      */

