mhorsche/F746_NucleoTemplate/Inc/stm32f7xx_hal_conf.h
  /* ########################## Assert Selection ############################## */
  /**
   * @brief Uncomment the line below to expanse the "assert_param" macro in the
   *        HAL drivers code
   */
  /* #define USE_FULL_ASSERT    1 */

  /* ################## Ethernet peripheral configuration for NUCLEO 144 board ##################### */

  /* Section 1 : Ethernet peripheral configuration */

/**
 * @brief MAC address is defined by FreeRTOS+TCP in 'FreeRTOSIPConfig.h':
 *        { ipconfigMAC_ADDR0 : ipconfigMAC_ADDR1 : ipconfigMAC_ADDR2 : ipconfigMAC_ADDR3 : ipconfigMAC_ADDR4 : ipconfigMAC_ADDR5 }
 */
#define MAC_ADDR0 2U
#define MAC_ADDR1 0U
#define MAC_ADDR2 0U
#define MAC_ADDR3 0U
#define MAC_ADDR4 0U
#define MAC_ADDR5 0U

/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE (1500 + 36U /* ipconfigNETWORK_MTU + ipSIZE_OF_ETH_HEADER */) /* buffer size for receive */
#define ETH_TX_BUF_SIZE (1500 + 36U /* ipconfigNETWORK_MTU + ipSIZE_OF_ETH_HEADER */) /* buffer size for transmit */
#define ETH_RX_DESC_CNT ((uint32_t)4U)                                                /* 4 Rx buffers of size ETH_RX_BUF_SIZE */
#define ETH_TX_DESC_CNT ((uint32_t)2U)                                                /* 2 Tx buffers of size ETH_TX_BUF_SIZE */

/* Section 2: PHY configuration section */
/* LAN8742A PHY Address*/
#define LAN8742A_PHY_ADDRESS 0x00U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY ((uint32_t)0x00000FFFU)
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY ((uint32_t)0x00000FFFU)

#define PHY_READ_TO ((uint32_t)0x0000FFFFU)
#define PHY_WRITE_TO ((uint32_t)0x0000FFFFU)

  /* Section 3: Common PHY Registers */

#define PHY_BCR ((uint16_t)0x00U) /*!< Transceiver Basic Control Register   */
#define PHY_BSR ((uint16_t)0x01U) /*!< Transceiver Basic Status Register    */

#define PHY_RESET ((uint16_t)0x8000U)                   /*!< PHY Reset */
#define PHY_LOOPBACK ((uint16_t)0x4000U)                /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M ((uint16_t)0x2100U)         /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M ((uint16_t)0x2000U)         /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M ((uint16_t)0x0100U)          /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M ((uint16_t)0x0000U)          /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION ((uint16_t)0x1000U)         /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION ((uint16_t)0x0200U) /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN ((uint16_t)0x0800U)               /*!< Select the power down mode           */
#define PHY_ISOLATE ((uint16_t)0x0400U)                 /*!< Isolate PHY from MII                 */

#define PHY_AUTONEGO_COMPLETE ((uint16_t)0x0020U) /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS ((uint16_t)0x0004U)     /*!< Valid link established               */
#define PHY_JABBER_DETECTION ((uint16_t)0x0002U)  /*!< Jabber condition detected            */

  /* Section 4: Extended PHY Registers */

#define PHY_SR ((uint16_t)0x1FU) /*!< PHY special control/ status register Offset     */

#define PHY_SPEED_STATUS ((uint16_t)0x0004U)  /*!< PHY Speed mask                                  */
#define PHY_DUPLEX_STATUS ((uint16_t)0x0010U) /*!< PHY Duplex mask                                 */

#define PHY_ISFR ((uint16_t)0x1DU)        /*!< PHY Interrupt Source Flag register Offset       */
#define PHY_ISFR_INT4 ((uint16_t)0x0010U) /*!< PHY Link down inturrupt                         */

  /* ################## SPI peripheral configuration ########################## */

  /* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
   * Activated: CRC code is present inside driver
   * Deactivated: CRC code cleaned from driver
   */

#define USE_SPI_CRC 1U

/* Includes ------------------------------------------------------------------*/
/**
 * @brief Include low-level header file
 */
#include "stm32f7xx_ll_cortex.h"
#include "stm32f7xx_ll_gpio.h"
  // #include "stm32f7xx_ll_adc.h"
  // #include "stm32f7xx_ll_i2c.h"
  // #include "stm32f7xx_ll_iwdg.h"
  // #include "stm32f7xx_ll_rcc.h"
  // #include "stm32f7xx_ll_bus.h"
  // #include "stm32f7xx_ll_system.h"
  // #include "stm32f7xx_ll_exti.h"
  // #include "stm32f7xx_ll_utils.h"
  // #include "stm32f7xx_ll_pwr.h"
  // #include "stm32f7xx_ll_dma.h"
  // #include "stm32f7xx_ll_spi.h"
  // #include "stm32f7xx_ll_tim.h"
  // #include "stm32f7xx_ll_usart.h"

  /**
   * @brief Include module's header file
   */

#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32f7xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32f7xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32f7xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32f7xx_hal_cortex.h"
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32f7xx_hal_adc.h"
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_CAN_MODULE_ENABLED
#include "stm32f7xx_hal_can.h"
#endif /* HAL_CAN_MODULE_ENABLED */

#ifdef HAL_CAN_LEGACY_MODULE_ENABLED
#include "stm32f7xx_hal_can_legacy.h"
#endif /* HAL_CAN_LEGACY_MODULE_ENABLED */

#ifdef HAL_CEC_MODULE_ENABLED
#include "stm32f7xx_hal_cec.h"
#endif /* HAL_CEC_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
#include "stm32f7xx_hal_crc.h"
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_CRYP_MODULE_ENABLED
#include "stm32f7xx_hal_cryp.h"
#endif /* HAL_CRYP_MODULE_ENABLED */

#ifdef HAL_DMA2D_MODULE_ENABLED
#include "stm32f7xx_hal_dma2d.h"
#endif /* HAL_DMA2D_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32f7xx_hal_dac.h"
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_DCMI_MODULE_ENABLED
#include "stm32f7xx_hal_dcmi.h"
#endif /* HAL_DCMI_MODULE_ENABLED */

#ifdef HAL_ETH_MODULE_ENABLED
#include "stm32f7xx_hal_eth.h"
#endif /* HAL_ETH_MODULE_ENABLED */

#ifdef HAL_ETH_LEGACY_MODULE_ENABLED
#include "stm32f7xx_hal_eth_legacy.h"
#endif /* HAL_ETH_LEGACY_MODULE_ENABLED */

